
# tap repositories
tap "caskroom/cask"
tap "caskroom/fonts"
tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "kylef/formulae"
tap "rcmdnk/file"
tap "sanemat/font"
tap "vapor/tap"
tap "atsushi130/tap"

# cask installed applications
cask "alcatraz"
cask "font-fira-code"
cask "intellij-idea"
cask "webstorm"
cask "appcode"
cask "datagrip"
cask "rubymine"
cask "clion"
cask "hyper"
cask "visual-studio-code"
cask "swiftybeaver"
cask "realm-browser"
cask "vivaldi"
cask "atom"
cask "ngrok"

# brew installed applications
brew "cf-cli"
brew "node"
brew "sqlite"
brew "emojify"
brew "cairo"
brew "libtiff"
brew "harfbuzz"
brew "xz"
brew "the_platinum_searcher"
brew "webp"
brew "ruby-build"
brew "openssl@1.1"
brew "mysql"
brew "gdbm"
brew "perl"
brew "readline"
brew "pcre"
brew "gobject-introspection"
brew "oniguruma"
brew "carthage"
brew "ghq"
brew "atsushi130/tap/kube"
brew "atsushi130/tap/dot"
brew "ffmpeg"
brew "kubernetes-helm"
brew "tig"
brew "anyenv"
brew "license-plist"
brew "lua"
brew "wget"
brew "gettext"
brew "fontconfig"
brew "fontforge"
brew "tmux"
brew "python3"
brew "sshrc"
brew "libpng"
brew "ctags"
brew "fzf"
brew "file-formula"
brew "glib"
brew "freetype"
brew "python"
brew "jq"
brew "bitrise"
brew "graphite2"
brew "the_silver_searcher"
brew "libtool"
brew "jpeg"
brew "libevent"
brew "libffi"
brew "ninja"
brew "pango"
brew "ruby"
brew "libyaml"
brew "rbenv-gemset"
brew "openssl"
brew "yarn"
brew "icu4c"
brew "reattach-to-user-namespace"
brew "gd"
brew "hiredis"
brew "libmagic"
brew "pixman"
brew "autoconf"
brew "rbenv"
brew "libuv"
brew "pkg-config"
brew "ghc"
brew "cabal-install"
brew "swiftenv"
brew "brew-file"
brew "ctls"
brew "vapor"
